SELECT ТОВАРЫ.*, ЗАКАЗЫ.Дата_поставки
FROM     ЗАКАЗЫ INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.Наименование_товара = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.Дата_поставки > CONVERT(DATETIME, '2024-12-12 00:00:00', 102))

SELECT ТОВАРЫ.*, ЗАКАЗЫ.Цена_продажи
FROM     ЗАКАЗЫ INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.Наименование_товара = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.Цена_продажи > 50 AND ЗАКАЗЫ.Цена_продажи < 150)

SELECT ЗАКАЗЧИКИ.Наименование_фирмы
FROM     ЗАКАЗЫ INNER JOIN
                  ЗАКАЗЧИКИ ON ЗАКАЗЫ.Заказчик = ЗАКАЗЧИКИ.Наименование_фирмы
WHERE  (ЗАКАЗЫ.Наименование_товара = N'cat')

SELECT ЗАКАЗЫ.*
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.Наименование_фирмы = ЗАКАЗЫ.Заказчик
WHERE  (ЗАКАЗЧИКИ.Наименование_фирмы = N'bstu')
ORDER BY ЗАКАЗЫ.Дата_поставки